<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"9720dddee229511234ef1c23650c2ec20ffe935c4c5ee3398a6e2c51668caf9e","plan_job_ref":"Job Test plan target and replace #424 at https://github.com/dflook/terraform-github-actions/actions/runs/9331228369","plan_out_hash":"a5834aef9eccb4ae612a8fc91a4f17020f79bd0deccdb44c5d53bf6ff6a1ca0c","plan_hash":"e98c5ccd89850e0f5ff6264a0e40d1db4b792192fbd0cc0060797f76fa691592","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "POMFYNWrac" -> (known after apply)
!~  foreach = "LAxNI7ovDw" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #424](https://github.com/dflook/terraform-github-actions/actions/runs/9331228369)